In [1]:
import pandas as pd

# 분류

데이터 설명 : 고객의 신상정보 데이터를 통한 회사 서비스 이탈 예측 (종속변수 : Exited)
<br>
x_train : https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_train.csv
<br>
y_train : https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/y_train.csv
<br>
x_test : https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_test.csv
<br>
x_label(평가용) : https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/y_test.csv
<br>
데이터 출처 : https://www.kaggle.com/shubh0799/churn-modelling 에서 변형

In [2]:
x_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_train.csv')
y_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/y_train.csv')
x_test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/churnk/X_test.csv')

In [3]:
display(x_train.head(),y_train.head(),x_test.head())

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,15799217,Zetticci,791,Germany,Female,35,7,52436.20,1,1,0,161051.75
1,15748986,Bischof,705,Germany,Male,42,8,166685.92,2,1,1,55313.51
2,15722004,Hsiung,543,France,Female,31,4,138317.94,1,0,0,61843.73
3,15780966,Pritchard,709,France,Female,32,2,0.00,2,0,0,109681.29
4,15636731,Ts'ai,714,Germany,Female,36,1,101609.01,2,1,1,447.73

   CustomerId  Exited
0    15799217       0
1    15748986       0
2    15722004       0
3    15780966       0
4    15636731       0

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
0,15601012,Abdullah,802,France,Female,60,3,92887.06,1,1,0,39473.63
1,15734762,Ignatiev,602,France,Female,56,3,115895.22,3,1,0,4176.17
2,15586757,Anenechukwu,801,France,Female,32,4,75170.54,1,1,1,37898.50
3,15590888,Wade,693,Spain,Female,34,10,107556.06,2,0,0,154631.35
4,15726087,Ch'in,592,France,Female,62,5,0.00,1,1,1,100941.57

In [4]:
drop_col = ['CustomerId','Surname']

x_train_drop = x_train.drop(columns=drop_col)
x_test_drop = x_test.drop(columns=drop_col)

In [5]:
x_train_dummies = pd.get_dummies(x_train_drop)
x_test_dummies = pd.get_dummies(x_test_drop)

In [6]:
x_test_dummies = x_test_dummies[x_train_dummies.columns]

In [7]:
y = y_train['Exited']

In [8]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split

In [9]:
x_train, x_valid, y_train, y_valid = train_test_split(x_train_dummies, y, test_size= 0.33, random_state= 42)

In [10]:
rf = RandomForestClassifier(random_state = 23)
rf.fit(x_train, y_train)

RandomForestClassifier(random_state=23)

In [11]:
x_train_label = rf.predict(x_train)
x_train_proba = rf.predict_proba(x_train)[:,1]

In [12]:
x_valid_label = rf.predict(x_valid)
x_valid_proba = rf.predict_proba(x_valid)[:,1]

In [13]:
from sklearn.metrics import accuracy_score, f1_score, precision_score, recall_score, roc_auc_score

In [14]:
accuracy_score(y_train,x_train_label)

1.0

In [15]:
accuracy_score(y_valid,x_valid_label)

0.8652680652680653

In [16]:
f1_score(y_train,x_train_label)

1.0

In [17]:
f1_score(y_valid,x_valid_label)

0.5912305516265912

In [18]:
precision_score(y_train,x_train_label)

1.0

In [19]:
precision_score(y_valid,x_valid_label)

0.8461538461538461

In [20]:
recall_score(y_train,x_train_label)

1.0

In [21]:
recall_score(y_valid,x_valid_label)

0.4543478260869565

In [22]:
roc_auc_score(y_train,x_train_proba)

1.0

In [23]:
roc_auc_score(y_valid,x_valid_proba)

0.8497613211198555

In [24]:
x_test_label = rf.predict(x_test_dummies)
x_test_proba = rf.predict_proba(x_test_dummies)[:,1]

In [25]:
pd.DataFrame({'CustomerId':x_test['CustomerId'],'Exied':x_test_label})

      CustomerId  Exied
0       15601012      1
1       15734762      1
2       15586757      0
3       15590888      0
4       15726087      0
...          ...    ...
3496    15733966      0
3497    15669994      0
3498    15712403      1
3499    15643819      0
3500    15644962      0

[3501 rows x 2 columns]

In [26]:
# pd.DataFrame({'CustomerId':x_test['CustomerId'],'Exied':x_test_label}).to_csv('test.csv',index = False)

데이터 설명 : 이직여부 판단 데이터 (target: 1: 이직 , 0 : 이직 x)
<br>
x_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_train.csv
<br>
y_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/y_train.csv
<br>
x_test: https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_test.csv
<br>
x_label(평가용) : https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/y_test.csv
<br>
데이터 출처 :https://www.kaggle.com/datasets/arashnic/hr-analytics-job-change-of-data-scientists (참고, 데이터 수정)

In [27]:
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/y_train.csv")
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_test.csv")

In [28]:
display(x_train.head(),y_train.head(),x_test.head())

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,25298,city_138,0.836,Male,No relevent experience,Full time course,High School,NaN,5,100-500,Pvt Ltd,1,45
1,4241,city_160,0.920,Male,No relevent experience,Full time course,High School,NaN,5,NaN,NaN,1,17
2,24086,city_57,0.866,Male,No relevent experience,no_enrollment,Graduate,STEM,10,NaN,NaN,1,50
3,26773,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,>4,135
4,32325,city_143,0.740,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,17

   enrollee_id  target
0        25298     0.0
1         4241     1.0
2        24086     0.0
3        26773     0.0
4        32325     1.0

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,7129,city_23,0.899,Male,No relevent experience,no_enrollment,Graduate,STEM,2,NaN,NaN,1,23
1,31037,city_44,0.725,Male,No relevent experience,Part time course,Masters,STEM,5,NaN,NaN,never,39
2,22179,city_103,0.920,Male,No relevent experience,Full time course,Graduate,STEM,7,NaN,NaN,2,262
3,29724,city_50,0.896,Male,No relevent experience,Full time course,Graduate,STEM,7,NaN,NaN,never,78
4,17977,city_149,0.689,Female,Has relevent experience,Full time course,Masters,STEM,19,50-99,Pvt Ltd,1,125

In [29]:
x_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12452 entries, 0 to 12451
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             12452 non-null  int64
 1   city                    12452 non-null  object
 2   city_development_index  12452 non-null  float64
 3   gender                  9535 non-null   object
 4   relevent_experience     12452 non-null  object
 5   enrolled_university     12195 non-null  object
 6   education_level         12137 non-null  object
 7   major_discipline        10586 non-null  object
 8   experience              12415 non-null  object
 9   company_size            8600 non-null   object
 10  company_type            8471 non-null   object
 11  last_new_job            12179 non-null  object
 12  training_hours          12452 non-null  int64
dtypes: float64(1), int64(2), object(10)
memory usage: 1.2+ MB

In [30]:
x_train.nunique()

enrollee_id               12452
city                        122
city_development_index       92
gender                        3
relevent_experience           2
enrolled_university           3
education_level               5
major_discipline              6
experience                   22
company_size                  8
company_type                  6
last_new_job                  6
training_hours              241
dtype: int64

In [31]:
x_train.isnull().sum()

enrollee_id                  0
city                         0
city_development_index       0
gender                    2917
relevent_experience          0
enrolled_university        257
education_level            315
major_discipline          1866
experience                  37
company_size              3852
company_type              3981
last_new_job               273
training_hours               0
dtype: int64

In [32]:
drop_col = ['enrollee_id','city','company_type','experience']
x_train_drop = x_train.drop(columns= drop_col)
x_test_drop = x_test.drop(columns= drop_col)

In [33]:
x_train_dummies = pd.get_dummies(x_train_drop)
x_test_dummies = pd.get_dummies(x_test_drop)

In [34]:
x_test_dummies = x_test_dummies[x_train_dummies.columns]

In [35]:
y = y_train['target'].astype('int')

In [36]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, f1_score, recall_score, precision_score, roc_auc_score

In [37]:
X_train, X_valid, Y_train, Y_valid = train_test_split(x_train_dummies, y, test_size=0.33, random_state=42)

In [38]:
rf = RandomForestClassifier(random_state=23)

In [39]:
rf.fit(X_train, Y_train)

RandomForestClassifier(random_state=23)

In [40]:
predict_train_label = rf.predict(X_train)
predict_train_proba = rf.predict_proba(X_train)[:,1]

In [41]:
predict_valid_label = rf.predict(X_valid)
predict_valid_proba = rf.predict_proba(X_valid)[:,1]

In [42]:
accuracy_score(Y_train,predict_train_label)

0.9965236154399425

In [43]:
accuracy_score(Y_valid,predict_valid_label)

0.7535279805352798

In [44]:
f1_score(Y_train,predict_train_label)

0.9929731039496001

In [45]:
f1_score(Y_valid,predict_valid_label)

0.42736009044657997

In [46]:
recall_score(Y_train,predict_train_label)

0.9927325581395349

In [47]:
recall_score(Y_valid,predict_valid_label)

0.3631123919308357

In [48]:
precision_score(Y_train,predict_train_label)

0.9932137663596704

In [49]:
precision_score(Y_valid,predict_valid_label)

0.5192307692307693

In [50]:
roc_auc_score(Y_train,predict_train_proba)

0.9998907607098495

In [51]:
roc_auc_score(Y_valid,predict_valid_proba)

0.740677513569584

In [52]:
x_test_label = rf.predict(x_test_dummies)
x_test_proba = rf.predict_proba(x_test_dummies)[:,1]

In [53]:
pd.DataFrame({'enrollee_id':x_test['enrollee_id'],'target':x_test_label})

      enrollee_id  target
0            7129       0
1           31037       0
2           22179       0
3           29724       0
4           17977       0
...           ...     ...
6701         3601       0
6702         2745       0
6703        18520       0
6704        10067       0
6705         8203       1

[6706 rows x 2 columns]

In [54]:
#pd.DataFrame({'enrollee_id':x_test['enrollee_id'],'target':x_test_label}).to_csv('test.csv',index=False)

In [55]:
pd.DataFrame({'enrollee_id':x_test['enrollee_id'],'target':x_test_proba})

      enrollee_id  target
0            7129    0.30
1           31037    0.37
2           22179    0.31
3           29724    0.37
4           17977    0.34
...           ...     ...
6701         3601    0.23
6702         2745    0.41
6703        18520    0.34
6704        10067    0.50
6705         8203    0.57

[6706 rows x 2 columns]

데이터 설명 : e-commerce 배송의 정시 도착여부 (1: 정시배송 0 : 정시미배송)
<br>
x_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_train.csv
<br>
y_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/y_train.csv
<br>
x_test: https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_test.csv
<br>
x_label(평가용) : https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/y_test.csv
<br>
데이터 출처 :https://www.kaggle.com/datasets/prachi13/customer-analytics (참고, 데이터 수정)

In [56]:
import pandas as pd

In [57]:
x_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_train.csv')
y_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/y_train.csv')
x_test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_test.csv')

In [58]:
display(x_train.head(),y_train.head(),x_test.head())

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,6045,A,Flight,4,3,266,5,high,F,5,1590
1,44,F,Ship,3,1,174,2,low,M,44,1556
2,7940,F,Road,4,1,154,10,high,M,10,5674
3,1596,F,Ship,4,3,158,3,medium,F,27,1207
4,4395,A,Flight,5,3,175,3,low,M,7,4833

     ID  Reached.on.Time_Y.N
0  6045                    0
1    44                    1
2  7940                    1
3  1596                    1
4  4395                    1

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,6811,D,Ship,5,2,259,5,low,F,7,1032
1,4320,F,Ship,3,5,133,3,medium,F,4,5902
2,5732,F,Road,3,4,191,5,medium,F,4,4243
3,7429,D,Ship,4,2,221,3,low,M,10,4126
4,2191,D,Flight,4,5,230,2,low,F,38,2890

In [59]:
drop_col = ['ID']
x_train_drop = x_train.drop(columns=drop_col)
x_test_drop = x_test.drop(columns=drop_col)

In [60]:
display(x_train_drop.head(),x_test_drop.head())

,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,A,Flight,4,3,266,5,high,F,5,1590
1,F,Ship,3,1,174,2,low,M,44,1556
2,F,Road,4,1,154,10,high,M,10,5674
3,F,Ship,4,3,158,3,medium,F,27,1207
4,A,Flight,5,3,175,3,low,M,7,4833

,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,D,Ship,5,2,259,5,low,F,7,1032
1,F,Ship,3,5,133,3,medium,F,4,5902
2,F,Road,3,4,191,5,medium,F,4,4243
3,D,Ship,4,2,221,3,low,M,10,4126
4,D,Flight,4,5,230,2,low,F,38,2890

In [61]:
x_train_dummeies = pd.get_dummies(x_train_drop)
x_test_dummeies = pd.get_dummies(x_test_drop)
x_test_dummeies = x_test_dummeies[x_train_dummeies.columns]

In [62]:
display(x_train_dummeies.head(),x_test_dummeies.head())

,Customer_rating,Cost_of_the_Product,Prior_purchases,Discount_offered,Weight_in_gms,Warehouse_block_A,Warehouse_block_B,Warehouse_block_C,Warehouse_block_D,Warehouse_block_F,...,Customer_care_calls_2,Customer_care_calls_3,Customer_care_calls_4,Customer_care_calls_5,Customer_care_calls_6,Product_importance_high,Product_importance_low,Product_importance_medium,Gender_F,Gender_M
0,3,266,5,5,1590,1,0,0,0,0,...,0,0,1,0,0,1,0,0,1,0
1,1,174,2,44,1556,0,0,0,0,1,...,0,1,0,0,0,0,1,0,0,1
2,1,154,10,10,5674,0,0,0,0,1,...,0,0,1,0,0,1,0,0,0,1
3,3,158,3,27,1207,0,0,0,0,1,...,0,0,1,0,0,0,0,1,1,0
4,3,175,3,7,4833,1,0,0,0,0,...,0,0,0,1,0,0,1,0,0,1

,Customer_rating,Cost_of_the_Product,Prior_purchases,Discount_offered,Weight_in_gms,Warehouse_block_A,Warehouse_block_B,Warehouse_block_C,Warehouse_block_D,Warehouse_block_F,...,Customer_care_calls_2,Customer_care_calls_3,Customer_care_calls_4,Customer_care_calls_5,Customer_care_calls_6,Product_importance_high,Product_importance_low,Product_importance_medium,Gender_F,Gender_M
0,2,259,5,7,1032,0,0,0,1,0,...,0,0,0,1,0,0,1,0,1,0
1,5,133,3,4,5902,0,0,0,0,1,...,0,1,0,0,0,0,0,1,1,0
2,4,191,5,4,4243,0,0,0,0,1,...,0,1,0,0,0,0,0,1,1,0
3,2,221,3,10,4126,0,0,0,1,0,...,0,0,1,0,0,0,1,0,0,1
4,5,230,2,38,2890,0,0,0,1,0,...,0,0,1,0,0,0,1,0,1,0

In [63]:
y_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6598 entries, 0 to 6597
Data columns (total 2 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   6598 non-null   int64
 1   Reached.on.Time_Y.N  6598 non-null   int64
dtypes: int64(2)
memory usage: 103.2 KB

In [64]:
y = y_train['Reached.on.Time_Y.N']
y

0       0
1       1
2       1
3       1
4       1
       ..
6593    1
6594    1
6595    1
6596    0
6597    0
Name: Reached.on.Time_Y.N, Length: 6598, dtype: int64

In [65]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier

In [66]:
X_train, X_valid, Y_train, Y_valid = train_test_split(x_train_dummeies, y, test_size= 0.33, random_state=42)

In [67]:
rf = RandomForestClassifier(random_state=23)

In [68]:
rf.fit(X_train, Y_train)

RandomForestClassifier(random_state=23)

In [69]:
predict_train_label = rf.predict(X_train)
predict_train_proba = rf.predict_proba(X_train)[:,1]
predict_valid_label = rf.predict(X_valid)
predict_valid_proba = rf.predict_proba(X_valid)[:,1]

In [70]:
from sklearn.metrics import accuracy_score, f1_score, recall_score, precision_score, roc_auc_score

In [71]:
accuracy_score(Y_train,predict_train_label)

1.0

In [72]:
accuracy_score(Y_valid,predict_valid_label)

0.6395775941230487

In [73]:
f1_score(Y_train,predict_train_label)

1.0

In [74]:
f1_score(Y_valid,predict_valid_label)

0.6744089589382

In [75]:
recall_score(Y_train,predict_train_label)

1.0

In [76]:
recall_score(Y_valid,predict_valid_label)

0.630721489526765

In [77]:
precision_score(Y_train,predict_train_label)

1.0

In [78]:
precision_score(Y_valid,predict_valid_label)

0.7245989304812834

In [79]:
roc_auc_score(Y_train,predict_train_proba)

1.0

In [80]:
roc_auc_score(Y_valid,predict_valid_proba)

0.7261997118475008

In [81]:
predict_test_label = rf.predict(x_test_dummeies)
predict_test_proba = rf.predict_proba(x_test_dummeies)[:,1]

In [82]:
pd.DataFrame({'ID':x_test['ID'],'Reached.on.Time_Y.N':predict_test_label})

         ID  Reached.on.Time_Y.N
0      6811                    1
1      4320                    0
2      5732                    0
3      7429                    1
4      2191                    1
...     ...                  ...
4396   2610                    1
4397   3406                    1
4398  10395                    1
4399   3646                    0
4400    573                    1

[4401 rows x 2 columns]

In [83]:
pd.DataFrame({'ID':x_test['ID'],'Reached.on.Time_Y.N':predict_test_proba})

         ID  Reached.on.Time_Y.N
0      6811                 0.53
1      4320                 0.39
2      5732                 0.38
3      7429                 0.52
4      2191                 1.00
...     ...                  ...
4396   2610                 0.97
4397   3406                 0.51
4398  10395                 0.59
4399   3646                 0.29
4400    573                 1.00

[4401 rows x 2 columns]

In [84]:
# pd.DataFrame({'ID':x_test['ID'],'Reached.on.Time_Y.N':predict_test_label}).to_csv('PHJ.csv',index=False)

데이터 설명 : 학생성적 예측 (종속변수 :G3)
<br>
x_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/X_train.csv
<br>
y_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/y_train.csv
<br>
x_test: https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/X_test.csv
<br>
x_label(평가용) : https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/y_test.csv
<br>
데이터 출처 :https://www.kaggle.com/datasets/ishandutta/student-performance-data-set (참고, 데이터 수정)

In [85]:
import pandas as pd
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/y_train.csv")
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/studentscore/X_test.csv")


display(x_train.head())
display(y_train.head())

,StudentID,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,...,romantic,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2
0,1714,GP,F,18,U,GT3,T,4,3,other,...,no,4,3,3,1,1,3,0,14,13
1,1254,GP,F,17,U,GT3,T,4,3,health,...,yes,4,4,3,1,3,4,0,13,15
2,1639,GP,F,16,R,GT3,T,4,4,health,...,no,2,4,4,2,3,4,6,10,11
3,1118,GP,M,16,U,GT3,T,4,4,services,...,no,5,3,3,1,3,5,0,15,13
4,1499,GP,M,19,U,GT3,T,3,2,services,...,yes,4,5,4,1,1,4,0,5,0

   StudentID  G3
0       1714  14
1       1254  15
2       1639  11
3       1118  13
4       1499   0

In [86]:
x_train.isnull().sum()

StudentID     0
school        0
sex           0
age           0
address       0
famsize       0
Pstatus       0
Medu          0
Fedu          0
Mjob          0
Fjob          0
reason        0
guardian      0
traveltime    0
studytime     0
failures      0
schoolsup     0
famsup        0
paid          0
activities    0
nursery       0
higher        0
internet      0
romantic      0
famrel        0
freetime      0
goout         0
Dalc          0
Walc          0
health        0
absences      0
G1            0
G2            0
dtype: int64

In [87]:
x_test.isnull().sum()

StudentID     0
school        0
sex           0
age           0
address       0
famsize       0
Pstatus       0
Medu          0
Fedu          0
Mjob          0
Fjob          0
reason        0
guardian      0
traveltime    0
studytime     0
failures      0
schoolsup     0
famsup        0
paid          0
activities    0
nursery       0
higher        0
internet      0
romantic      0
famrel        0
freetime      0
goout         0
Dalc          0
Walc          0
health        0
absences      0
G1            0
G2            0
dtype: int64

In [88]:
drop_col = ['StudentID']

In [89]:
x_train_drop = x_train.drop(columns = drop_col)
x_test_drop = x_test.drop(columns=drop_col)

In [90]:
x_train_dummeies = pd.get_dummies(x_train_drop)
x_test_dummeies = pd.get_dummies(x_test_drop)
x_test_dummeies = x_test_dummeies[x_train_dummeies.columns]

In [91]:
y_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 678 entries, 0 to 677
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   StudentID  678 non-null    int64
 1   G3         678 non-null    int64
dtypes: int64(2)
memory usage: 10.7 KB

In [92]:
y = y_train['G3']
y

0      14
1      15
2      11
3      13
4       0
       ..
673    14
674    11
675    13
676    10
677    18
Name: G3, Length: 678, dtype: int64

In [93]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestRegressor

In [94]:
X_train, X_valid, Y_train, Y_valid = train_test_split(x_train_dummeies,y,random_state=42)
rf = RandomForestRegressor(random_state=42)

In [95]:
rf.fit(X_train,Y_train)

RandomForestRegressor(random_state=42)

In [96]:
predict_valid_label = rf.predict(X_valid)

In [97]:
from sklearn.metrics import mean_squared_error, mean_absolute_error, mean_absolute_percentage_error, r2_score

In [98]:
mean_squared_error(Y_valid,predict_valid_label)

1.2731176470588235

In [99]:
mean_absolute_error(Y_valid,predict_valid_label)

0.8254117647058823

In [100]:
mean_absolute_percentage_error(Y_valid,predict_valid_label)

395786931958324.8

In [101]:
import numpy as np

In [102]:
np.sqrt(mean_squared_error(Y_valid,predict_valid_label))

1.1283251513011767

In [103]:
r2_score(Y_valid,predict_valid_label)

0.9085269833850866

데이터 설명 : 중고차 가격 예측 데이터 (종속변수 :G3)
<br>
x_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/X_train.csv
<br>
y_train: https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/y_train.csv
<br>
x_test: https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/X_test.csv
<br>
x_label(평가용) : https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/y_test.csv
<br>
데이터 출처 :https://www.kaggle.com/datasets/adityadesai13/used-car-dataset-ford-and-mercedes?select=vw.csv (참고, 데이터 수정)

In [104]:
import pandas as pd
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/y_train.csv")
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/carsprice/X_test.csv")


display(x_train,x_test,y_train)

,carID,brand,model,year,transmission,mileage,fuelType,tax,mpg,engineSize
0,13207,hyundi,Santa Fe,2019,Semi-Auto,4223,Diesel,145.0,39.8,2.2
1,17314,vauxhall,GTC,2015,Manual,47870,Diesel,125.0,60.1,2.0
2,12342,audi,RS4,2019,Automatic,5151,Petrol,145.0,29.1,2.9
3,13426,vw,Scirocco,2016,Automatic,20423,Diesel,30.0,57.6,2.0
4,16004,skoda,Scala,2020,Semi-Auto,3569,Petrol,145.0,47.1,1.0
...,...,...,...,...,...,...,...,...,...,...
4955,16898,merc,GL Class,2015,Automatic,24314,Diesel,125.0,56.6,2.1
4956,14416,bmw,6 Series,2017,Automatic,18000,Diesel,145.0,51.4,3.0
4957,15453,vw,CC,2015,Manual,84932,Diesel,30.0,60.1,2.0
4958,14666,audi,A7,2017,Semi-Auto,30150,Diesel,145.0,62.8,3.0
4959,15135,merc,SLK,2014,Automatic,40230,Diesel,150.0,56.5,3.0

,carID,brand,model,year,transmission,mileage,fuelType,tax,mpg,engineSize
0,12000,merc,GLS Class,2017,Automatic,12046,Diesel,150.0,37.2,3.0
1,12001,vw,Amarok,2017,Automatic,37683,Diesel,260.0,36.2,3.0
2,12004,merc,GLS Class,2019,Automatic,10000,Diesel,145.0,34.0,3.0
3,12013,skoda,Scala,2019,Manual,3257,Petrol,145.0,49.6,1.0
4,12017,audi,RS6,2015,Semi-Auto,20982,Petrol,325.0,29.4,4.0
...,...,...,...,...,...,...,...,...,...,...
2667,19618,audi,A7,2015,Semi-Auto,21100,Petrol,325.0,29.7,4.0
2668,19620,merc,CLS Class,2015,Automatic,60972,Diesel,160.0,52.3,3.0
2669,19626,ford,Puma,2020,Manual,4111,Petrol,145.0,50.4,1.0
2670,19630,merc,CLA Class,2016,Automatic,25726,Petrol,200.0,41.5,2.0
2671,19631,vauxhall,Antara,2007,Automatic,99500,Diesel,565.0,32.8,2.0

      carID  price
0     13207  31995
1     17314   7700
2     12342  58990
3     13426  12999
4     16004  16990
...     ...    ...
4955  16898  17999
4956  14416  28900
4957  15453   8998
4958  14666  23198
4959  15135  14900

[4960 rows x 2 columns]

In [105]:
display(x_train.nunique(),x_test.nunique())

carID           4960
brand              9
model             90
year              24
transmission       4
mileage         3900
fuelType           5
tax               41
mpg              125
engineSize        37
dtype: int64

carID           2672
brand              9
model             89
year              23
transmission       4
mileage         2226
fuelType           5
tax               34
mpg              107
engineSize        32
dtype: int64

In [106]:
display(x_train.isnull().sum(),x_test.isnull().sum())

carID           0
brand           0
model           0
year            0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

carID           0
brand           0
model           0
year            0
transmission    0
mileage         0
fuelType        0
tax             0
mpg             0
engineSize      0
dtype: int64

In [107]:
drop_col = ['carID']
x_train_drop = x_train.drop(columns=drop_col)
x_test_drop = x_test.drop(columns=drop_col)

In [108]:
x_concat = pd.concat([x_train_drop,x_test_drop])

In [109]:
x_dummies = pd.get_dummies(x_concat)

In [110]:
x_train_dummeies = x_dummies[:len(x_train_drop)]
x_test_dummeies = x_dummies[len(x_train_drop):]

In [111]:
display(x_train_dummeies,x_test_dummeies)

,year,mileage,tax,mpg,engineSize,brand_audi,brand_bmw,brand_ford,brand_hyundi,brand_merc,...,model_ i8,transmission_Automatic,transmission_Manual,transmission_Other,transmission_Semi-Auto,fuelType_Diesel,fuelType_Electric,fuelType_Hybrid,fuelType_Other,fuelType_Petrol
0,2019,4223,145.0,39.8,2.2,0,0,0,1,0,...,0,0,0,0,1,1,0,0,0,0
1,2015,47870,125.0,60.1,2.0,0,0,0,0,0,...,0,0,1,0,0,1,0,0,0,0
2,2019,5151,145.0,29.1,2.9,1,0,0,0,0,...,0,1,0,0,0,0,0,0,0,1
3,2016,20423,30.0,57.6,2.0,0,0,0,0,0,...,0,1,0,0,0,1,0,0,0,0
4,2020,3569,145.0,47.1,1.0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4955,2015,24314,125.0,56.6,2.1,0,0,0,0,1,...,0,1,0,0,0,1,0,0,0,0
4956,2017,18000,145.0,51.4,3.0,0,1,0,0,0,...,0,1,0,0,0,1,0,0,0,0
4957,2015,84932,30.0,60.1,2.0,0,0,0,0,0,...,0,0,1,0,0,1,0,0,0,0
4958,2017,30150,145.0,62.8,3.0,1,0,0,0,0,...,0,0,0,0,1,1,0,0,0,0
4959,2014,40230,150.0,56.5,3.0,0,0,0,0,1,...,0,1,0,0,0,1,0,0,0,0

,year,mileage,tax,mpg,engineSize,brand_audi,brand_bmw,brand_ford,brand_hyundi,brand_merc,...,model_ i8,transmission_Automatic,transmission_Manual,transmission_Other,transmission_Semi-Auto,fuelType_Diesel,fuelType_Electric,fuelType_Hybrid,fuelType_Other,fuelType_Petrol
0,2017,12046,150.0,37.2,3.0,0,0,0,0,1,...,0,1,0,0,0,1,0,0,0,0
1,2017,37683,260.0,36.2,3.0,0,0,0,0,0,...,0,1,0,0,0,1,0,0,0,0
2,2019,10000,145.0,34.0,3.0,0,0,0,0,1,...,0,1,0,0,0,1,0,0,0,0
3,2019,3257,145.0,49.6,1.0,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1
4,2015,20982,325.0,29.4,4.0,1,0,0,0,0,...,0,0,0,0,1,0,0,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2667,2015,21100,325.0,29.7,4.0,1,0,0,0,0,...,0,0,0,0,1,0,0,0,0,1
2668,2015,60972,160.0,52.3,3.0,0,0,0,0,1,...,0,1,0,0,0,1,0,0,0,0
2669,2020,4111,145.0,50.4,1.0,0,0,1,0,0,...,0,0,1,0,0,0,0,0,0,1
2670,2016,25726,200.0,41.5,2.0,0,0,0,0,1,...,0,1,0,0,0,0,0,0,0,1
2671,2007,99500,565.0,32.8,2.0,0,0,0,0,0,...,0,1,0,0,0,1,0,0,0,0

In [112]:
y = y_train['price']
y

0       31995
1        7700
2       58990
3       12999
4       16990
        ...
4955    17999
4956    28900
4957     8998
4958    23198
4959    14900
Name: price, Length: 4960, dtype: int64

In [113]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestRegressor

In [114]:
X_train, X_valid, Y_train, Y_valid = train_test_split(x_train_dummeies, y,random_state=42)

In [115]:
rf = RandomForestRegressor(random_state=42)

In [116]:
rf.fit(X_train,Y_train)

RandomForestRegressor(random_state=42)

In [117]:
predict_valid_label = rf.predict(X_valid)

In [118]:
from sklearn.metrics import mean_squared_error, mean_absolute_error, mean_absolute_percentage_error, r2_score

In [119]:
mean_squared_error(Y_valid, predict_valid_label)

11947340.127473561

In [120]:
mean_absolute_error(Y_valid, predict_valid_label)

2020.424363521156

In [121]:
mean_absolute_percentage_error(Y_valid, predict_valid_label)

0.0939487281678635

In [122]:
np.sqrt(mean_squared_error(Y_valid, predict_valid_label))

3456.4924602078277

In [123]:
r2_score(Y_valid, predict_valid_label)

0.9572562784217051